runTestCases/initialCases/6_pehill/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "2";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
14751
(
7.54214e-08
7.48201e-08
7.48818e-08
7.41172e-08
7.35394e-08
7.2511e-08
7.13273e-08
6.99739e-08
...
)
;

boundaryField
{
    bottomWall
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
99
(
2.98756e-14
4.65173e-14
1.50607e-15
1.34823e-15
3.867e-15
1e-15
1e-15
1e-15
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
99
(
1.10767e-11
1.09007e-11
1.09197e-11
1.06991e-11
1.05338e-11
1.02423e-11
9.91167e-12
9.54003e-12
...
)
;
    }
}


// ************************************************************************* //
