runTestCases/initialCases/6_pehill/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(-2.49124e-06 1.01234e-08 0)
(-2.84131e-06 9.95281e-08 1.35061e-22)
(-1.12841e-06 1.65786e-07 -1.00158e-21)
(1.1001e-06 -4.25404e-07 -2.21021e-25)
(1.36509e-06 -7.94307e-07 -2.83999e-21)
(7.13068e-07 -5.2882e-07 1.30896e-21)
(5.22765e-07 -4.31567e-07 -1.2263e-21)
(3.28291e-07 -2.80565e-07 7.34684e-40)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(-3.99801e-06 -4.52791e-10 0)
(-3.9825e-06 9.54466e-11 0)
(-3.98448e-06 -5.02389e-10 5.58846e-29)
(-3.9637e-06 -5.9662e-10 -5.59154e-29)
(-3.94807e-06 -8.54911e-10 1.03975e-28)
(-3.91975e-06 -1.10981e-09 -1.73649e-27)
(-3.8869e-06 -1.27197e-09 0)
(-3.84902e-06 -1.46924e-09 2.30171e-29)
...
)
;
    }
}


// ************************************************************************* //
