runTestCases/initialCases/6_pehill/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
( 
  "lib_FG_MoE_incompressibleRAS.so"
) ;


application     PysimpleFoam;

//startFrom       latestTime;
startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          1.0e-4;

writeControl    runTime;

writeInterval   0.1;//20000;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat              general;

timePrecision   6;

runTimeModifiable true;

functions
{

  turbulenceFields1
  {
    // Mandatory entries (unmodifiable)
    type            turbulenceFields;
    libs            (fieldFunctionObjects);
    fields           (R);
    enabled         true;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
  }

  wallShearStress1
  {
      type            wallShearStress;
      libs            (fieldFunctionObjects);
      patches         (down);
      writePrecision  8;
      enabled         true;
      executeControl  timeStep;
      executeInterval 1;
      writeControl    writeTime;
  }

  yPlus
  {
    // Mandatory entries (unmodifiable)
    type            yPlus;
    libs            (fieldFunctionObjects);
    enabled         true;
    executeControl  timeStep;
    executeInterval 10;
    writeControl    writeTime;
  }


}